In [1]:
import pandas as pd
import mysql.connector as sql

In [2]:
df = pd.read_csv('events_data.csv')
df.head()

,event_id,device_id,timestamp,longitude,latitude,city,state
0,1.0,2.918269e+16,2016-05-01 00:55:25,77.266049,28.68161,Delhi,Delhi
1,7104.0,2.918269e+16,2016-05-02 09:37:02,77.266049,28.68161,Delhi,Delhi
2,29661.0,2.918269e+16,2016-05-04 00:56:04,77.266049,28.68161,Delhi,Delhi
3,33133.0,2.918269e+16,2016-05-06 05:01:15,77.266049,28.68161,Delhi,Delhi
4,38980.0,2.918269e+16,2016-05-06 09:55:04,77.266049,28.68161,Delhi,Delhi

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3252950 entries, 0 to 3252949
Data columns (total 7 columns):
event_id     float64
device_id    float64
timestamp    object
longitude    float64
latitude     float64
city         object
state        object
dtypes: float64(4), object(3)
memory usage: 173.7+ MB

In [4]:
df.describe()

           event_id     device_id     longitude      latitude
count  3.252950e+06  3.252497e+06  3.252527e+06  3.252527e+06
mean   1.626476e+06  1.012200e+17  7.815868e+01  2.168851e+01
std    9.390459e+05  5.316758e+18  4.235570e+00  5.789111e+00
min    1.000000e+00 -9.222957e+18  1.256700e+01  8.190110e+00
25%    8.132382e+05 -4.540611e+18  7.583543e+01  1.780171e+01
50%    1.626476e+06  1.726820e+17  7.726814e+01  2.216454e+01
75%    2.439713e+06  4.861813e+18  8.031916e+01  2.868278e+01
max    3.252950e+06  9.222849e+18  9.545946e+01  4.187190e+01

In [5]:
df.nunique()

event_id     3252950
device_id      60865
timestamp     588126
longitude      60095
latitude       60185
city             933
state             32
dtype: int64

In [6]:
db = sql.connect(host='cpanel.insaid.co', database='Capstone1', user='student', password='student')
df_gen_age_train = pd.read_sql('SELECT * FROM gender_age_train', con=db)
df_dev_model = pd.read_sql('SELECT * FROM phone_brand_device_model', con=db)

InterfaceError: 2003: Can't connect to MySQL server on 'cpanel.insaid.co:3306' (10060 A connection attempt failed because the connected party did not properly respond after a period of time, or established connection failed because connected host has failed to respond)

In [31]:
df_gen_age_train.head()

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [33]:
df_gen_age_train.describe()

          device_id           age
count  7.464500e+04  74645.000000
mean  -7.491354e+14     31.410342
std    5.327150e+18      9.868735
min   -9.223067e+18      1.000000
25%   -4.617367e+18     25.000000
50%   -1.841362e+16     29.000000
75%    4.636656e+18     36.000000
max    9.222849e+18     96.000000

In [41]:
df_gen_age_train[df_gen_age_train.age > 90]

                 device_id gender  age group
5958  -7047596037344697961      F   96  F43+
60872  1177477789654193646      F   94  F43+

In [42]:
df_gen_age_train[df_gen_age_train.age < 10]

                 device_id gender  age group
10385  3553057874282315257      M    1  M22-
60779 -8513863533705424532      M    6  M22-
60831 -5323874218045578676      M    6  M22-
60832  3646841514566479686      M    6  M22-
60833  5222152119137955379      M    6  M22-

In [34]:
df_gen_age_train.nunique()

device_id    74645
gender           2
age             85
group           12
dtype: int64

In [32]:
df_dev_model.head()

             device_id phone_brand device_model
0  1877775838486905855        vivo          Y13
1 -3766087376657242966          小米         V183
2 -6238937574958215831        OPPO          R7s
3  8973197758510677470          三星        A368t
4 -2015528097870762664          小米      红米Note2

In [43]:
df_dev_model[df_dev_model.device_id == 3553057874282315257 ]

                 device_id phone_brand device_model
18653  3553057874282315257          魅族           魅蓝

In [46]:
df[df.device_id == '3553057874282315257']

C:\Users\rk000u\AppData\Local\Continuum\anaconda3\envs\ML\lib\site-packages\pandas\core\ops\__init__.py:1115: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

Empty DataFrame
Columns: [event_id, device_id, timestamp, longitude, latitude, city, state]
Index: []

In [35]:
df_dev_model.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87726 entries, 0 to 87725
Data columns (total 3 columns):
device_id       87726 non-null int64
phone_brand     87726 non-null object
device_model    87726 non-null object
dtypes: int64(1), object(2)
memory usage: 2.0+ MB

In [38]:
df_dev_model.describe(include='all')

           device_id phone_brand device_model
count   8.772600e+04       87726        87726
unique           NaN         116         1467
top              NaN          小米       红米note
freq             NaN       21645         3500
mean   -5.212557e+15         NaN          NaN
std     5.330157e+18         NaN          NaN
min    -9.223322e+18         NaN          NaN
25%    -4.623331e+18         NaN          NaN
50%    -3.109802e+16         NaN          NaN
75%     4.635194e+18         NaN          NaN
max     9.222849e+18         NaN          NaN